{
  "presentations": [
    {
      "id": "1",
      "slug": "isp-network-architecture",
      "title": "ISP Network Architecture",
      "description": "A comprehensive technical deep-dive into Triple Play services, Access Networks, Fixed Core, and GPON technology.",
      "thumbnail": "/thumbnails/isp.jpg",
      "template": "Research",
      "createdAt": "2024-12-25",
      "accentColor": "from-cyan-500 to-blue-600",
      "sections": [
        {
          "id": "hero",
          "type": "hero",
          "title": "ISP Network Architecture",
          "subtitle": "Technical Deep Dive",
          "content": "Understanding the layered architecture of modern ISP networks: from fiber access to core routing, service delivery, and content optimization."
        },
        {
          "id": "triple-play-intro",
          "type": "topic",
          "title": "Triple Play Service",
          "content": "Triple Play represents the convergence of Internet, IPTV, and VoIP over a single broadband infrastructure. In modern GPON-based networks, this convergence is achieved by logical separation rather than physical segregation."
        },
        {
          "id": "triple-play-vlans",
          "type": "keypoints",
          "title": "VLAN Service Separation",
          "items": [
            {
              "title": "Internet Traffic (VLAN 100)",
              "description": "Best-effort unicast traffic for web browsing, downloads, and general connectivity."
            },
            {
              "title": "IPTV Traffic (VLAN 200)",
              "description": "Multicast for live TV channels, unicast for on-demand video (VOD) content."
            },
            {
              "title": "VoIP Traffic (VLAN 300)",
              "description": "Low-latency, real-time unicast streams requiring priority QoS treatment."
            }
          ]
        },
        {
          "id": "triple-play-routing",
          "type": "definition",
          "title": "Traffic Routing in Triple Play",
          "content": "Internet and VoIP traffic routes through BRAS for subscriber authentication and policy enforcement, while IPTV traffic bypasses BRAS and reaches the SPINE switch directly. QoS is enforced end-to-end, ensuring VoIP and IPTV maintain priority during high Internet usage."
        },
        {
          "id": "triple-play-devices",
          "type": "components",
          "title": "Service-Aware Devices",
          "items": [
            {
              "title": "ONT",
              "description": "Handles VLAN tagging at customer premises, separating Triple Play services at ingress.",
              "icon": "🏠"
            },
            {
              "title": "OLT",
              "description": "Performs traffic shaping, multicast replication for IPTV, and upstream scheduling.",
              "icon": "📡"
            },
            {
              "title": "BRAS",
              "description": "Manages subscriber authentication, IP policy enforcement, and AAA accounting.",
              "icon": "🔐"
            }
          ]
        },
        {
          "id": "access-network-intro",
          "type": "topic",
          "title": "Access Network",
          "content": "The access network is the physical and logical path connecting subscriber devices to the first provider-managed service node. It handles traffic encapsulation, VLAN tagging, and QoS marking but does not perform IP routing or subscriber authentication—those are tasks for BRAS and HCORE."
        },
        {
          "id": "access-network-components",
          "type": "components",
          "title": "Access Network Components",
          "items": [
            {
              "title": "CPE/Home Gateway",
              "description": "Customer premises equipment providing WiFi, routing, and service demarcation.",
              "icon": "📶"
            },
            {
              "title": "ONT/MDU",
              "description": "Optical Network Terminal converting fiber signals to Ethernet for the subscriber.",
              "icon": "💡"
            },
            {
              "title": "Optical Splitter",
              "description": "Passive device splitting one fiber into multiple subscriber connections (1:32 or 1:64).",
              "icon": "🔀"
            },
            {
              "title": "OLT",
              "description": "Optical Line Terminal at the central office managing all ONTs in the PON tree.",
              "icon": "🏢"
            },
            {
              "title": "Metro Cluster",
              "description": "Active-Standby aggregation switches providing redundancy and uplink diversity.",
              "icon": "🔄"
            }
          ]
        },
        {
          "id": "access-network-ha",
          "type": "definition",
          "title": "High Availability in Access",
          "content": "The access network ensures reliability using Active-Standby Metro clusters and redundant OLT uplinks. IPTV multicast replication and VoIP QoS tagging are handled at this layer. Most subscriber-level outages occur here: ONT failures, split fiber cuts, or local power issues. Metro switch and OLT uplink failures are mitigated by HA mechanisms."
        },
        {
          "id": "core-network-intro",
          "type": "topic",
          "title": "Fixed Core Network",
          "content": "The Fixed Core network is the intelligence and aggregation layer for all subscriber traffic. It consists of BRAS, HCORE, SIG, and IGW/MIX. This layer provides subscriber authentication, IP assignment, policy enforcement, routing, NAT, and external peering."
        },
        {
          "id": "core-network-components",
          "type": "components",
          "title": "Core Network Components",
          "items": [
            {
              "title": "BRAS",
              "description": "Subscriber edge device handling authentication, IP assignment (private/public), policy, and AAA.",
              "icon": "🛡️"
            },
            {
              "title": "HCORE",
              "description": "Aggregates BRAS traffic, implements routing/traffic engineering, directs flows to SIG or CDN.",
              "icon": "🌐"
            },
            {
              "title": "SIG",
              "description": "Provides NAT (CGNAT for private IPs), security filtering, and external peering to Internet/MIX.",
              "icon": "🔒"
            },
            {
              "title": "IGW/MIX",
              "description": "Internet Gateway and Mongolian Internet Exchange for public peering and transit.",
              "icon": "🌍"
            }
          ]
        },
        {
          "id": "core-network-features",
          "type": "keypoints",
          "title": "Core Network Capabilities",
          "items": [
            {
              "title": "Dual IP Support",
              "description": "Supports both private IP subscribers (CGNAT at SIG) and public IP subscribers with direct routing."
            },
            {
              "title": "Session Persistence",
              "description": "Maintains seamless connectivity and session persistence during BRAS failover events."
            },
            {
              "title": "CDN Integration",
              "description": "Interfaces with HCDN for efficient content distribution, caching, and reduced transit costs."
            }
          ]
        },
        {
          "id": "gpon-intro",
          "type": "topic",
          "title": "GPON Technology",
          "content": "GPON (Gigabit Passive Optical Network) is the access technology backbone for modern fiber broadband. It multiplexes multiple subscribers over a single fiber using Time-Division Multiple Access (TDMA) for upstream and broadcast for downstream."
        },
        {
          "id": "gpon-features",
          "type": "keypoints",
          "title": "GPON Technical Features",
          "items": [
            {
              "title": "ONT Identification",
              "description": "Each ONT is identified by serial and port ID, authenticated via OLT using PLOAM messages."
            },
            {
              "title": "Downstream Encryption",
              "description": "Traffic is encrypted per ONT using AES-128, ensuring subscriber privacy on shared fiber."
            },
            {
              "title": "Bandwidth Allocation",
              "description": "Deterministic bandwidth per subscriber through T-CONT and Dynamic Bandwidth Allocation (DBA)."
            },
            {
              "title": "Multicast Efficiency",
              "description": "IPTV multicast streams are replicated efficiently at the OLT, reducing upstream bandwidth."
            }
          ]
        },
        {
          "id": "gpon-scale",
          "type": "definition",
          "title": "GPON Scalability",
          "content": "GPON enables the access network to scale to thousands of subscribers while preserving QoS and HA. Service separation (Internet, IPTV, VoIP) occurs at the physical layer with VLAN-based isolation. Unicast VOD flows are forwarded to SPINE switches while multicast is replicated at OLT level."
        },
        {
          "id": "unified-intro",
          "type": "topic",
          "title": "Unified Architecture View",
          "content": "Together, Triple Play, Access Network, Fixed Core, and GPON form a layered architecture that delivers reliable, scalable, and differentiated services to subscribers."
        },
        {
          "id": "unified-layers",
          "type": "keypoints",
          "title": "Architecture Layers",
          "items": [
            {
              "title": "Layer 1: GPON",
              "description": "Fiber-based physical foundation connecting subscriber premises to metro aggregation."
            },
            {
              "title": "Layer 2: Access Network",
              "description": "ONTs, splitters, OLTs, and metro clusters ensuring HA and proper service separation."
            },
            {
              "title": "Layer 3: Fixed Core",
              "description": "Subscriber logic, routing, policy enforcement, NAT, and content optimization."
            },
            {
              "title": "Layer 4: Triple Play Services",
              "description": "Internet, IPTV, and VoIP delivered over these layers with VLANs and QoS ensuring coexistence."
            }
          ]
        },
        {
          "id": "unified-analysis",
          "type": "definition",
          "title": "Unified Analysis Capability",
          "content": "Understanding these four components together allows you to analyze packet flows, failure points, IP mapping, multicast delivery, and redundancy mechanisms. This knowledge is essential for troubleshooting, capacity planning, and network optimization in ISP environments."
        }
      ]
    }
  ]
}
